Revit 2026 API

# OutlineMinimumPoint Property

---

The minimum point of the bounding box.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ MinimumPoint { get; set; }
```
```vb
Public Property MinimumPoint As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ MinimumPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member MinimumPoint : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Outline Class

Autodesk.Revit.DB Namespace